

&НаКлиенте
Процедура Подключаемый_ЗавершитьПодборИсполнителейДляПроцессов(
	ВыбранныеИсполнители, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеИсполнители = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ВыбранныеИсполнители Цикл
		СтрокаТЧ=Элементы.ТаблицаПеременных.ТекущиеДанные;
		Если СтрокаТЧ=Неопределено Тогда
			Возврат;
		КонецЕсли;

		СтрокаТЧ.Значение = Строка;
		Прервать;
	КонецЦикла;
	
	Элементы.ТаблицаПеременных.ТекущийЭлемент = Элементы.ТаблицаПеременныхОписание;
	Модифицированность = Истина;
	
КонецПроцедуры


&НаКлиенте
&Вместо("ЗначениеНачалоВыбора")
Процедура ЧСД_ЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЭтаФорма.Элементы.ТаблицаПеременных.ТекущиеДанные.НаименованиеПеременной = "Исполнитель заявки" Тогда
		
		СтандартнаяОбработка = Ложь;
		ОписаниеОповещенияОбработкиВыбора = Новый ОписаниеОповещения(
			"Подключаемый_ЗавершитьПодборИсполнителейДляПроцессов", ЭтотОбъект);

		Исполнители.Очистить();
		РаботаСАдреснойКнигойКлиент.ПодобратьИсполнителейДляПроцессов(
			ЭтаФорма, Исполнители, ОписаниеОповещенияОбработкиВыбора);
			
	Иначе	
		ПродолжитьВызов(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры



