
&Вместо("ПолучитьЗаявкуПоТикету")
Функция ЧСД_ПолучитьЗаявкуПоТикету(ТикетПисьма)
	Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                    |	СД_ПараметрыЗаявокСрезПоследних.Заявка
	                    |ИЗ
	                    |	РегистрСведений.СД_ПараметрыЗаявок.СрезПоследних(
	                    //|			&ДатаЗаписи,
	                    |				,ПараметрЗаявки = &ПараметрЗаявки
	                    |				И ЗначениеПараметра = &ЗначениеПараметра) КАК СД_ПараметрыЗаявокСрезПоследних");
						
	//Запрос.УстановитьПараметр("ДатаЗаписи", ТекущаяДата());						
	Запрос.УстановитьПараметр("ПараметрЗаявки", ПланыВидовХарактеристик.СД_ПараметрыЗаявок.ТикетЗаявки);
	Запрос.УстановитьПараметр("ЗначениеПараметра", ТикетПисьма);
	Выборка=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Заявка;
		
	Иначе
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции
