
&НаСервере
Процедура ЧСД_СверитьДанныеСУОПоТипу(ТипЗаявки, Приоритеты,СрокПоУмолчанию)
	
	СтруктураПоиска = Новый Структура("Тип,Приоритет", ТипЗаявки,);
	Пока Приоритеты.Следующий() Цикл
		СтруктураПоиска.Приоритет = Приоритеты.Наименование;
		Результат = Объект.Ч_СУО.НайтиСтроки(СтруктураПоиска);
		Если Результат.Количество() <= 0 Тогда
			Строка = Объект.Ч_СУО.Добавить();
			Строка.Тип = ТипЗаявки;
			Строка.Приоритет = Приоритеты.Ссылка;
			Строка.Срок =СрокПоУмолчанию;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЧСД_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                       |    КОЛИЧЕСТВО(ССЫЛКА) КАК ВсегоЭлементов
                       |ИЗ
                       |    Справочник.СД_Приоритет КАК Спр";      
    Выборка = Запрос.Выполнить().Выгрузить();
	Если Объект.Ч_СУО.Количество() < Выборка[0].ВсегоЭлементов * 3 Тогда
		
		Приоритеты = Справочники.СД_Приоритет.Выбрать();
		ЧСД_СверитьДанныеСУОПоТипу(Перечисления.Ч_ТипыЗаявокСД.Обслуживание, Приоритеты, 8);
		ЧСД_СверитьДанныеСУОПоТипу(Перечисления.Ч_ТипыЗаявокСД.Инцидент, Приоритеты, 4);
		ЧСД_СверитьДанныеСУОПоТипу(Перечисления.Ч_ТипыЗаявокСД.Доработка, Приоритеты, 40);
		
	КонецЕсли;	
	
КонецПроцедуры
