
&НаСервере
&Вместо("СоздатьРешениеПоЗаявке")
Функция ЧСД_СоздатьРешениеПоЗаявке()
	ТекущийПользователь=Пользователи.ТекущийПользователь();
	
	ДокРешение=Документы.СД_Решение.СоздатьДокумент();
	ДокРешение.Дата=ТекущаяДата();
	ДокРешение.Заявка=ЗаявкаВТехПоддержку;
	ДокРешение.Автор=ТекущийПользователь;
	ДокРешение.Комментарий="Создано при ручном закрытии заявки";
	
	//установим текст решения
	ФормТекст=Новый ФорматированныйДокумент;
	ФормТекст.УстановитьHTML(ТекстРешения, Новый Структура);
	
	ДокРешение.ОписаниеРешенияХранилищеФорматированногоТекста=Новый ХранилищеЗначения(ФормТекст);
	ДокРешение.ОписаниеРешенияТекст=ТекстРешения;	
	
	ДокРешение.Подразделение=ТекущийПользователь.Подразделение;

	Попытка
		ДокРешение.Записать();
	Исключение
		СД_ОбщееВызовСервера.ЗаписатьОшибку(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	// savilov отправляю уведомление 
	СД_ИнтернетШлюзСервер.ОтправитьРешениеИнициатору(ДокРешение.Ссылка);
	// /savilov
	Возврат Истина;
	
КонецФункции
